{ 
  "basics": {
    "name": "Alexander TaeYang Chang",
    "label": "Student",
    "picture": "https://github.com/jang-taeyang.png",
    "email": "atyc@hawaii.edu",
    "phone": "808-773-2572",
    "website": "https://jang-taeyang.github.io",
    "summary": "I am a student pursuing a Bachelor of Science (B.S.) and Master of Science (M.S.) in Computer Engineering in the Department of Electrical and Computer Engineering at the University of Hawaii at Manoa. As a participant under the University's BAM (Bachelor's and Master's) program, I am on an accelarated pathway to acheive both degrees. I expect to graduate with my B.S. in Spring, 2025. I anticipate completing my M.S. by Fall, 2026.",
    "location": { "address": "2206 Laukahi Street", "postalCode": "96821", "city": "Honolulu", "countryCode": "USA", "region": "Hawaii" },
    "profiles": [
      { "network": "github", "username": "jang-taeyang", "url": "http://github.com/jang-taeyang" },
      { "network": "linkedin", "username": "changtaeyang", "url": "http://linkedin.com/in/changtaeyang" }
    ]
  },
  "interests": [
    { "name": "Cyber Security" },
    { "name": "Computer Hardware" },
    { "name": "Embedded Engineering" },
    { "name": "Full Stack Engineering" },
    { "name": "Renewable Energy" }
  ],
  "skills": [
    {
      "name": "Languages and Frameworks",
      "keywords": [ "C", "C++", "Java", "Javascript", "Assembly", "Python" , "Matlab", "HTML", "Python"  ]
    },
    {
      "name": "Toolsets/OS",
      "keywords": [ "MacOS", "Visual Studio Code", "Git/GitHub", "CLion", "Command Line Interface", "EDA Playground", "iTerm2", "Xilinx Vivado", "Wiliki"   ]
    }
  ],
  "education": [
    {
      "institution": "University of Hawaii, Honolulu, HI",
      "area": "Computer Engineering (expected Spring, 2025)",
      "studyType": "B.S.",
      "startDate": "Spring 2022",
      "endDate": "Present",
      "courses": [
      ]
    },
    {
      "institution": "University of Hawaii, Honolulu, HI",
      "area": "Sociology",
      "studyType": "B.A.",
      "startDate": "Fall 2014",
      "endDate": "Fall 2019",
      "courses": [
      ]
    }
  ],
  "work": [
    {
      "company": "Hankoook Hawaii Inc",
      "position": "Customer Service Representative Guide",
      "startDate": "Spring 2020",
      "endDate": "Present",
      "summary": "Korean Tour Guide",
      "highlights": [
        "Required fluent speaking in both Korean and English languages.",
        "Showcased exceptional customer service and problem-solving skills.",
        "Provided administrative and operational support within the tour guide department, ensuring efficient day-to-day logistics."
      ]
    },
    {
      "company": "AT&T",
      "position": "Commission Sales Associate",
      "startDate": "Spring 2017",
      "endDate": "Fall 2017",
      "summary": "Multinational Telecommmunications",
      "highlights": [
        "Processed transactions through device activations and upgrades, following the proper guidelines of company policies.",
        "Consistently exceeded targeted sales in service plans, bundles, wireless devices, internet plans in combination with promotional offerings.",
        "Delivered exceptional customer service through assistance in product information, selection, service plans, and technical support to provide a personalized experience for clientele."
      ]
    },
    {
      "company": "Oakley",
      "position": "Retail Sales Representative",
      "startDate": "Spring 2015",
      "endDate": "Fall 2016",
      "summary": "Sports & Lifestyle Brand Eyewear Manufacturer",
      "highlights": [
        "Assisted in proper store presentation and visual merchandising to display products in an engaging retail environment.",
        "Maintained deep knowledge of Oakley eyewear products, new releases, features, purposes, best sellers, and compatibility with face shapes.",
        "Provided excellent customer service through product knowledge, selection, and assistance, ensuring a tailored shopping experience surpassing Oakley’s brand standard."
      ]
    },
    {
      "company": "AutoXChange LTD",
      "position": "Automotive Salesman",
      "startDate": "Fall 2014",
      "endDate": "Fall 2015",
      "summary": "Pre-Owned Automotive Dealership",
      "highlights": [
        "Assisted in selecting pre-owned vehicles of numerous brands through understanding customer needs, preferences, budgets and credit score.",
        "Provided excellent negotiation skills in pricing and financing options to meet monthly sales targets while excelling in high customer satisfaction and loyalty.",
        "Consistently understood in-depth knowledge of current and future dealership inventories, providing accurate information and recommendations without assisted resources."
      ]
    },
    {
      "company": "AutoXChange LTD",
      "position": "Automotive Lot Technician",
      "startDate": "Spring 2012",
      "endDate": "Fall 2014",
      "summary": "Pre-Owned Automotive Dealership",
      "highlights": [
        "Supported sales and service departments by consistently moving vehicles, deliveries to customer homes, and coordinating logistics.",
        "Conducted vehicle inspections, cleaned vehicle interiors and exteriors, providing light to advanced detailing workmanship across all inventory.",
        "Managed daily relocation of vehicle inventory through organization, staging, and maintenance skills within the dealership lot to display an appealing customer-friendly environment."
      ]
    }
  ],
  "volunteer": [
    {
      "organization": "University of Hawaii at Manoa K-12 College of Engineering Tour",
      "position": "HSFL Ke Ao Aerospace Technologies Software Division",
      "startDate": "Spring 2024",
      "endDate": "Spring 2024",
      "summary": "College of Engineering tours for local K-12 students, providing an in-depth overview of the University of Hawaiʻi at Mānoa’s engineering programs and inspiring interest in STEM education and careers.",
      "highlights": [
        "Provided an overview of the VIP HSFL Ke Ao Aerospace Technologies Lab, highlighting its role in advancing aerospace research and innovation at the University of Hawaiʻi.",
        "Explained the lab’s mission to develop cost-effective, small satellite systems for scientific research and exploration.",
        "Demonstrated how the lab integrates cutting-edge technologies, such as CubeSat development and ground station operations, to support space missions.",
        "Shared insights into the multidisciplinary teamwork required in aerospace projects, emphasizing collaboration among engineering, physics, and computer science students."
      ]
    }
  ],
  "awards & honors": [
    {
      "title": "IEEE Eta Kappa Nu (HKN) Pledge",
      "date": "2024-2025",
      "awarder": "University of Hawaii",
      "summary": "Eta Kappa Nu (HKN) is the honor society of IEEE, recognizing excellence in electrical and computer engineering, and fostering leadership, service, and professional development among its members."
    },
    {
      "title": "Deans List",
      "date": "2024",
      "awarder": "University of Hawaii",
      "summary": "Students who achieve a grade point average (GPA) of 3.5+ for the semester, while being enrolled as a full-time student earning 12+ credits."
    }
  ],
  "references": [
    {
      "name": "Available upon request"
    }
  ]
}
